uhnp/src/Enums/МераКоличестваПредметаРасчетаККТ/МераКоличестваПредметаРасчетаККТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МераКоличестваПредметаРасчетаККТ</name>
  <enumValues>
    <name>Штука</name>
  </enumValues>
  <enumValues>
    <name>Грамм</name>
  </enumValues>
  <enumValues>
    <name>Килограмм</name>
  </enumValues>
  <enumValues>
    <name>Тонна</name>
  </enumValues>
  <enumValues>
    <name>Сантиметр</name>
  </enumValues>
  <enumValues>
    <name>Дециметр</name>
  </enumValues>
  <enumValues>
    <name>Метр</name>
  </enumValues>
  <enumValues>
    <name>КвадратныйСантиметр</name>
  </enumValues>
  <enumValues>
    <name>КвадратныйДециметр</name>
  </enumValues>
  <enumValues>
    <name>КвадратныйМетр</name>
  </enumValues>
  <enumValues>
    <name>Миллилитр</name>
  </enumValues>
  <enumValues>
    <name>Литр</name>
  </enumValues>
  <enumValues>
    <name>КубическийМетр</name>
  </enumValues>
  <enumValues>
    <name>КиловаттЧас</name>
  </enumValues>
  <enumValues>
    <name>Гигакалория</name>
  </enumValues>
  <enumValues>
    <name>СуткиДень</name>
  </enumValues>
  <enumValues>
    <name>Час</name>
  </enumValues>
  <enumValues>
    <name>Минута</name>
  </enumValues>
  <enumValues>
    <name>Секунда</name>
  </enumValues>
  <enumValues>
    <name>Килобайт</name>
  </enumValues>
  <enumValues>
    <name>Мегабайт</name>
  </enumValues>
  <enumValues>
    <name>Гигабайт</name>
  </enumValues>
  <enumValues>
    <name>Терабайт</name>
  </enumValues>
  <enumValues>
    <name>ИныеЕдиницыИзмерения</name>
    <comment>Применяется при использовании иных единиц измерения</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/МераКоличестваПредметаРасчетаККТ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает коды меры количества предмета расчета ККТ.
// 
// Возвращаемое значение:
//  Соответствие
//
Функция КодыМерыКоличестваПредметаРасчетаККТ() Экспорт
	
	МерыКоличества = Новый Соответствие();
	
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Штука"), 0);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Грамм"), 10);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Килограмм"), 11);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Тонна"), 12);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Сантиметр"), 20);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Дециметр"), 21);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Метр"), 22);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.КвадратныйСантиметр"), 30);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.КвадратныйДециметр"), 31);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.КвадратныйМетр"), 32);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Миллилитр"), 40);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Литр"), 41);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.КубическийМетр"), 42);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.КиловаттЧас"), 50);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Гигакалория"), 51);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.СуткиДень"), 70);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Час"), 71);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Минута"), 72);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Секунда"), 73);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Килобайт"), 80);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Мегабайт"), 81);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Гигабайт"), 82);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Терабайт"), 83);
	МерыКоличества.Вставить(ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.ИныеЕдиницыИзмерения"), 255);
	
	Возврат МерыКоличества;
	
КонецФункции

// Возвращает меры количества предмета расчета по кодам.
// 
// Возвращаемое значение:
//  Соответствие
//
Функция МераКоличестваПредметаРасчетаККТПоКоду() Экспорт
	
	МерыКоличества = Новый Соответствие();
	
	МерыКоличества.Вставить(0, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Штука"));
	МерыКоличества.Вставить(10, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Грамм"));
	МерыКоличества.Вставить(11, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Килограмм"));
	МерыКоличества.Вставить(12, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Тонна"));
	МерыКоличества.Вставить(20, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Сантиметр"));
	МерыКоличества.Вставить(21, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Дециметр"));
	МерыКоличества.Вставить(22, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Метр"));
	МерыКоличества.Вставить(30, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.КвадратныйСантиметр"));
	МерыКоличества.Вставить(31, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.КвадратныйДециметр"));
	МерыКоличества.Вставить(32, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.КвадратныйМетр"));
	МерыКоличества.Вставить(40, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Миллилитр"));
	МерыКоличества.Вставить(41, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Литр"));
	МерыКоличества.Вставить(42, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.КубическийМетр"));
	МерыКоличества.Вставить(50, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.КиловаттЧас"));
	МерыКоличества.Вставить(51, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Гигакалория"));
	МерыКоличества.Вставить(70, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.СуткиДень"));
	МерыКоличества.Вставить(71, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Час"));
	МерыКоличества.Вставить(72, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Минута"));
	МерыКоличества.Вставить(73, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Секунда"));
	МерыКоличества.Вставить(80, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Килобайт"));
	МерыКоличества.Вставить(81, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Мегабайт"));
	МерыКоличества.Вставить(82, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Гигабайт"));
	МерыКоличества.Вставить(83, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Терабайт"));
	МерыКоличества.Вставить(255, ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.ИныеЕдиницыИзмерения"));
	
	Возврат МерыКоличества;
	
КонецФункции

// Возвращает меру количества предмета расчета по коду единицы измерения.
// 
// Возвращаемое значение:
//  Соответствие
// 
Функция МераКоличестваПредметаРасчетаПоКодуЕдиницыИзмерения() Экспорт
	
	МерыКоличества = Новый Соответствие();
	
	МерыКоличества.Вставить("796", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Штука"));
	
	МерыКоличества.Вставить("163", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Грамм"));
	МерыКоличества.Вставить("166", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Килограмм"));
	МерыКоличества.Вставить("168", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Тонна"));
	
	МерыКоличества.Вставить("004", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Сантиметр"));
	МерыКоличества.Вставить("005", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Дециметр"));
	МерыКоличества.Вставить("006", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Метр"));
	
	МерыКоличества.Вставить("051", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.КвадратныйСантиметр"));
	МерыКоличества.Вставить("053", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.КвадратныйДециметр"));
	МерыКоличества.Вставить("055", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.КвадратныйМетр"));
	
	МерыКоличества.Вставить("111", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Миллилитр"));
	МерыКоличества.Вставить("112", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Литр"));
	МерыКоличества.Вставить("113", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.КубическийМетр"));
	
	МерыКоличества.Вставить("245", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.КиловаттЧас"));
	МерыКоличества.Вставить("233", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Гигакалория"));
	
	МерыКоличества.Вставить("359", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.СуткиДень"));
	МерыКоличества.Вставить("356", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Час"));
	МерыКоличества.Вставить("355", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Минута"));
	МерыКоличества.Вставить("354", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Секунда"));
	
	МерыКоличества.Вставить("256", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Килобайт"));
	МерыКоличества.Вставить("257", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Мегабайт"));
	МерыКоличества.Вставить("2553", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Гигабайт"));
	МерыКоличества.Вставить("2554", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Терабайт"));
	
	МерыКоличества.Вставить("ИныеЕдиницыИзмерения", ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.ИныеЕдиницыИзмерения"));
	Возврат МерыКоличества;
	
КонецФункции

// Возвращает код единицы измерения по ККТ коду.
// 
// Возвращаемое значение:
//  Соответствие
//
Функция КодыЕдиницИзмеренияПоККТКоду() Экспорт
	
	КодыЕдиниц = Новый Соответствие;
	КодыЕдиниц.Вставить(0, "796");
	КодыЕдиниц.Вставить(10, "163");
	КодыЕдиниц.Вставить(11, "166");
	КодыЕдиниц.Вставить(12, "168");
	КодыЕдиниц.Вставить(20, "004");
	КодыЕдиниц.Вставить(21, "005");
	КодыЕдиниц.Вставить(22, "006");
	КодыЕдиниц.Вставить(30, "051");
	КодыЕдиниц.Вставить(31, "053");
	КодыЕдиниц.Вставить(32, "055");
	КодыЕдиниц.Вставить(40, "111");
	КодыЕдиниц.Вставить(41, "112");
	КодыЕдиниц.Вставить(42, "113");
	КодыЕдиниц.Вставить(50, "245");
	КодыЕдиниц.Вставить(51, "233");
	КодыЕдиниц.Вставить(70, "359");
	КодыЕдиниц.Вставить(71, "356");
	КодыЕдиниц.Вставить(72, "355");
	КодыЕдиниц.Вставить(73, "354");
	КодыЕдиниц.Вставить(80, "256");
	КодыЕдиниц.Вставить(81, "257");
	КодыЕдиниц.Вставить(82, "2553");
	КодыЕдиниц.Вставить(83, "2554");
	Возврат КодыЕдиниц;
	
КонецФункции

#КонецОбласти

#КонецЕсли
